[{"name": "40.001 Probability", "description": "The course aims at providing the students with the basic tools for modelling and analysing situations that involve uncertainty and will consider applications in various fields. The course will develop a rigorous analysis of finite probability models and provide an introduction to infinite models. The course will cover the following topics: axioms of probability, conditional probability and independence, random variables, random vectors, probability distributions, properties of expectation and limit theorems.", "pre_requisite": [["10.004 Advanced Math II"]], "learning_objectives": [["Develop and evaluate simple probabilistic models of engineering systems.", "Have a working knowledge of basics of probability: common distributions and processes, laws of probability and how to apply them, independence and conditional probability, common operations on random variables", "Understand Central Limit Theorem and other limit theorems, and how to apply", "Understand the basics of Poisson processes and its implications in understanding standard queueing models"]], "measurable_outcomes": [["Describe and explain the fundamental concepts of probability", "Apply the laws of probability to engineering system problems with uncertainty", "Apply limit theorems to draw inferences from data"]]}, {"name": "40.002 Optimisation", "description": "The course covers a broad range of optimisation algorithms and models. The course will cover the following topics: linear programming, simplex algorithm, duality, sensitivity analysis, two player zero-sum games, network optimisation, minimum cost flow, network simplex algorithm, integer programming, branch and bound methods, cutting plane methods, dynamic programming. Throughout the course, a number of applications from various areas will be discussed.", "pre_requisite": [["10.004 Advanced Math II"]], "learning_objectives": [["Formulate a linear optimisation model and determine the appropriate algorithm to solve", "Understand and appreciate the relative computational difficulty of different types of optimisation models", "Understand duality and sensitivity analysis for linear optimisation", "Identify potential applications of optimisation to engineering systems problems"]], "measurable_outcomes": [["Be able to formulate a linear optimisation model and know how to solve it", "Be able to interpret the output from the solution of an optimisation problem and provide intuition on why it is the optimum", "Be able to interpret and apply the sensitivity analysis reports from linear optimisation", "Demonstrate a working knowledge of software for solving optimisation problems"]]}, {"name": "40.004 Statistics", "description": "The course provides an introduction to applied statistics and data analysis. The course will cover the following topics: collecting and exploring data, estimation and hypothesis testing, linear regression, analysis of variance and elementary methods in non-parametric statistics. Applications and examples based on engineering systems data will be given.", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Examine data and use tools to visualize the data to uncover relationships", "Develop estimates and confidence intervals from a data sample; perform hypotheses testing and goodness-of-fit tests", "Build a regression model and estimate the parameters, and perform a diagnosis on the quality and validity of the model", "Design an experiment and conduct analysis of variance for a multi-treatment sample"]], "measurable_outcomes": [["Demonstrate working knowledge of statistical methods and tools", "Perform various types of data analysis: estimation, hypothesis testing, goodness-of-fit; regression; ANOVA", "Know what methods to use when for statistical inference and estimation"]]}, {"name": "40.011 Data and Business Analytics", "description": "This course provides an introduction to the Engineering Systems and Design pillar by focusing on using industrial or commercial data to identify an opportunity for system improvement and estimating the value of this improvement to the system owner. A signature feature of the course and the primary motivation for the course material comes from a team-based, semester-long project for an external client. Students develop skills in organising industrial projects and in presenting their results in oral, written, and poster form. In addition, problems in improving system throughput and flowtime are used throughout to motivate many of the topics. Students acquire skills in data manipulation, data visualisation, data analysis, system modelling, revenue and cost estimation, financial ratio analysis, and business simulation.", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Plan a project in functional terms identifying inputs, deliverables, resources, client choices, and intermediate work products.", "Execute a data or business analytics project for a client from project definition through to oral, written, and poster presentation of the results and recommendations.", "Demonstrate basic skills in transforming raw data into forms useful for visualisation and analysis.", "Demonstrate the ability to extract and plot data in 2D and geographical representations.", "Apply data analytic techniques as appropriate for diagnosis, estimation, and prediction.", "Model a basic queueing system.", "Develop and assess the outcome of a financial planning model.", "Derive a quantitative value proposition for a system improvement."]], "measurable_outcomes": [["Development of a project plan expressed diagrammatically as a hierarchical functional architecture.", "Development of database queries to join data tables, calculate intermediate results, filter data based on criteria, and aggregate results to achieve a desired report.", "Application of parallel coordinates to identify correlated variables.", "Creation of a thematic map in a geographical information system.", "Application of Little’s Law.", "Estimation and determination of significance of parameters for a multiple linear regression.", "Plot and measurement of the goodness of fit of a multiple linear regression.", "Application of a time series forecasting method.", "Estimation of queue lengths in a simple network of queues.", "Estimation of sales revenue from top down (market share) or bottom up (price elasticity) approach.", "Estimation of variable costs using a learning curve model.", "Interpretation of financial ratios for a start-up company.", "Creation of a financial planning spreadsheet for a start-up company.", "Identification of a business value proposition.", "Development and delivery of an oral presentation, poster presentation, executive summary, and written report suitable for a professional audience, which describes the key aspects of the project from problem statement to final results and recommendations."]]}, {"name": "40.012 Manufacturing and Service Operations", "description": "This course introduces concepts and techniques related to the design, planning, control, and improvement of both manufacturing and service systems. The course provides basic definitions of operations management terms, tools and techniques for analyzing system operations, and a strategic context for making operational decisions. In particular, the topics covered include: Manufacturing and inventory decisions for single and multi-echelon systems under deterministic and stochastic demand in the presence or absence of production/transportation lead time; trade-off between fixed cost of production and inventory holding costs; trade-off between holding and back-order/stock-out costs;", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Recognize the differences between manufacturing and service systems, and the challenges in the design and operation of these systems.", "Identify and appropriately model the various costs associated with the operation of these systems namely, fixed order/production cost, variable production cost, inventory holding cost, backorder/stock-out cost, capacity investment cost, server operation cost and queueing delay cost.", "Formulate simple models and problems of inventory control, queueing, and Markov chains that can be used to analyze and improve the operations of a variety of manufacturing/service systems.", "Design priority queues and risk pooling for both queueing and inventory.", "Use Microsoft Excel and R tools to solve the above problems.", "Extract and analyze real data for modeling and analyzing inventory and queuing systems.", "Plan and execute a project related to manufacturing (inventory) or service operations (queueing) management for real business clients."]], "measurable_outcomes": [["Formulation of mathematical models of inventory management for single/multi-echelon systems under deterministic and stochastic demand, under periodic and continuous inventory review, in the presence/absence of fixed order costs and supply lead times.", "Modelling and analysis of discrete Markov chains for some simple inventory policy.", "Formulation of one- and multi-dimension Markov chains for single-server and multi-station queueing problems; estimation of long-term costs, idle probability, queueing lengths and waiting times; and development of simple priority, risk pooling, and simple scheduling policies for queueing system management.", "Design of priority queues to differentiate customer classes without seriously impacting overall performances.", "Design of risk pooling strategies for queueing and inventory management: 1-million-dollar idea.", "Solution of above problems using Excel based solvers and R scripts.", "Discussion of industry cases related to above topics.", "Participation in a competitive simulation game that simulates real world inventory management scenario.", "Completion of a term-long industry project focused on design and improvement of inventory or queueing systems. Delivery of oral presentation and written report, suitable for a professional audience, which describes the key aspects of the project from problem statement to final results and recommendations."]]}, {"name": "40.014 Engineering Systems Architecture", "description": "The purpose of this course is to prepare students to exercise leadership in data analytics and decision support projects. The topics and skills to be taught are drawn from data science, decision science, operations research, design science, project management, and system architecture. The organizing principle of the course is a process view of a typical decision support project: Understand the need, design the database, transform the data, visualize the data, develop the decision support, and design the user application. We demonstrate how ethical considerations can be raised through use-cases and an awareness of the misuse of data visualization. Conceptual topics are illustrated with case studies, practical applications, and software implementations. Students also conduct a term-long team design project culminating in a prototype web-based, database-supported, decision support tool.", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Articulate an iterative process of design applicable to the development of decision support systems and identify graphical communication tools suitable for each stage of design. [An extension to the Freshmore Design World process]", "Identify and apply functional programming tools for constructing data transformation pipelines with the goal of assembling ‘tidy data’ suitable for visualization and analysis. [‘tidy data’= each data record constitutes a single observation with measurable attributes and identifiable features.]", "Explain the concepts and terminology of multi-objective optimization and identify common algorithms used in their analysis."]], "measurable_outcomes": [["Code a pipeline transforming raw data into tidy data stored in a remote relational database.", "Code a data visualization pipeline from a remote relational database.", "Code an interactive user interface to an online decision support tool.", "Demonstrate facility with functional programming commands (select, map, filter, reduce, mutate, arrange, group by, pivot).", "Design and implement a database schema.", "Design a decision support tool and document the process using diagrams to convey user needs, product value, process map, and logical system architecture (functional requirements by subsystem).", "Formulate a multi-objective linear program and compute and display a Pareto efficient frontier."]]}, {"name": "40.015 Simulation Modelling and Analysis", "description": "This course will introduce students to various aspects of analyzing complex systems using simulation methodologies. The course will address broadly four main forms of simulation of systems:", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Identify complex problems such as facility design for heavy industry or patient flow design for hospitals, which could be analyzed using simulation tools.", "Describe and Interpret salient features of different simulation methodologies.", "Implement various simulation techniques using programming tools.", "Analyze and critically Evaluate competing systems using simulation tools."]], "measurable_outcomes": [["Demonstrating critical thinking skills in identifying complex problems from a variety of disciplines that can be precisely formulated for analysis using simulation tools.", "Identifying and Comparing different simulation methodologies, including but not restricted to, Discrete Event simulation, Monte Carlo Simulation, Agent-based Simulation, and Systems Dynamics (simulation).", "Examining and Executing random number generation techniques for discrete and continuous distributions as well as random processes both theoretically as well as using programming tools (R, MS Excel, Python).", "Implementing the aforementioned simulation methodologies (described in (3)) using available software, for example, AnyLogic, MS Excel or R.", "Determining and Analyzing burn-in periods and simulation run times to achieve statistically reliable estimates of simulated system performance.", "Recommending and Ranking competing systems by Designing simulation experiments as well as Employing statistical inference and variance reduction techniques for comparison studies."]]}, {"name": "40.016 The Analytics Edge", "description": "The increasing availability of data is changing the way organizations are thinking about themselves and the way they interact with the world. Data is helping improve the profits of businesses, the quality of life of individuals, the predictions on performance of sports teams and social interactions. In this course you will learn how to use data and analytics to give you an edge. The course will expose students to real world examples of how analytics is being used with examples from Moneyball, Watson and the Framingham Heart Study among others. Through these examples you will learn on how to use tools of analytics such as linear regression, logistic regression, classification and regression trees, graphical models, visualization, text analytics, clustering and optimization in practice. The statistical software R and spreadsheets will be used in the course.", "pre_requisite": [["40.002 Optimisation"]], "learning_objectives": [["Identify the link between data and models to help make better decisions that add value to individuals, companies and institutions", "Describe data effectively, predict future outcomes and prescribe decisions using the tools of analytics"]], "measurable_outcomes": [["Develop a mathematical model from a given dataset", "Solve the mathematical model in the software R using the tools of analytics such as regression, classification and regression trees, graphical models, visualization, text analytics, clustering and optimization in a problem context.", "Justify the decisions from the mathematical model are better than heuristics and expert judgements"]]}, {"name": "40.017 Probability and Statistics", "description": "This course builds upon the material taught in Modelling Uncertainty. The course will provide students with the foundations of data analysis, and give them tools for analyzing situations that involve uncertainty and building statistical models. It will also develop students’ critical thinking skills. Applications and examples relevant to engineering systems will be given. The topics covered will include: multivariate normal, Poisson process, limit theorems, regression, point and interval estimation, hypothesis testing, analysis of variance, and introductory Bayesian statistics.", "pre_requisite": [["10.018 Modelling Space and Systems"]], "learning_objectives": [["Develop and evaluate sophisticated probabilistic models of engineering systems.", "Perform computations with joint and conditional distributions, using integration and other methods.", "Use the Poisson process to model arrivals and occurrences of events.", "Understand and apply the central limit theorem and other limit theorems.", "Develop point estimates and confidence intervals from a sample, for a variety of scenarios.", "Perform hypothesis tests and goodness-of-fit tests, for a variety of scenarios; compute the power of a hypothesis test.", "Build a regression model and estimate the parameters, then perform a diagnosis on the quality and validity of the model.", "Gain an understanding of Bayesian statistics, including prior and posterior distributions and basic Bayesian inference."]], "measurable_outcomes": [["Identify common distributions (such as exponential, Poisson, normal) and use them to compute probabilities, expectations, and variances.", "Compute probabilities, expectations, correlations, and other relevant statistics involving joint, marginal and conditional distributions.", "Develop models for complex systems using multivariate distributions (e.g. normal) and Poisson processes.", "Apply limit theorems to draw inference from data.", "Demonstrate knowledge of what methods to use for statistical inference and estimation in a variety of applications, as well as understand limitations of such procedures.", "Perform a variety of data analytic techniques including point estimates, confidence intervals, hypothesis tests, goodness-of-fit tests, and ANOVA, as well as interpret results of such analysis.", "Construct regression models from data, verify the validity of the models and use them to make predictions.", "Compute posterior distributions and Bayes estimates."]]}, {"name": "40.230 Sustainable Engineering", "description": "Sustainable engineering is the integration of social, environmental, and economic considerations in the design of products, processes, and engineered systems. This course introduces the concept of sustainability – both theory and applications – to engineers and designers. Students will apply tools to perform environmental impact assessment, life-cycle cost and benefits analyses, which provide decision guidance on the design, maintenance, and operations of products and systems.", "pre_requisite": [], "learning_objectives": [["Learn about grand societal challenges in energy and environment", "Explain the role of technology, economics and policy in addressing these challenges", "Evaluate the environmental impact of products, processes, services and systems", "Develop and apply life cycle and systems thinking methods to design"]], "measurable_outcomes": [["Conduct, report and orally present a conceptual eco-design process", "Recognize and evaluate environmentally preferable designs and solutions", "Develop a life cycle assessment of a product, service or system"]]}, {"name": "40.232 Water Resources Management", "description": "The goal of this course is to develop basic skills and knowledge for modelling, managing and planning water resources systems in a participated and sustainable way. Particular emphasis is given to 1) the application of statistical modelling and optimisation techniques to the design and management of natural and urban water systems, and 2) the implementation of these techniques in numerical computing environments (e.g., MatLab and R). A key aspect of the course is a term-long project.", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Define, discuss and apply the basic ideas of integrated water resources management to both natural and urban environments", "Employ and test statistical and process-based models to describe the main components of a river basin", "Develop and evaluate optimization-based models for the planning and management of river basins", "Analyse the main components of urban water systems"]], "measurable_outcomes": [["Identify and model the socio-economic functions of a river basin;", "Run simple mathematical models to describe hydrological and hydraulic processes, and analyse the corresponding outputs;", "Aggregate different models and use them for decision-making (optimization) problems;", "Assess the outcomes of planning and management problems;", "Apply mathematical models for drainage systems and pressure pipe networks."]]}, {"name": "40.240 Investment Science", "description": "This course will focus on the financial theory of asset pricing. While this course will be broad in scope and will cover many different topics relating to finance, a particular emphasis will be placed on topics related to financial markets. The primary topics covered in the class include present value, asset valuation, expected utility, portfolio selection, and the trade-off between risk and return.", "pre_requisite": [["10.004 Advanced Math II"]], "learning_objectives": [["Define, model and price various financial instruments, including stocks and bonds", "Construct optimal portfolios, based on mean-variance efficiency and utility theory, using probability and optimization", "Use the trading lab to research stocks and select a portfolio of stocks in one sector for semester-long “stock pitching” project."]], "measurable_outcomes": [["Price stocks, bonds and work with the term structure of interest rates.", "Use portfolio theory to select mean-variance optimal portfolios.", "Provide sector analysis and insight on individual stocks within a sector.", "Improve professional presentation skills with in class “stock pitches.”"]]}, {"name": "40.242 Derivative Pricing and Risk Management", "description": "Introduction to the theory and practice of mathematical finance: basics of derivative securities; interest rate and bonds; forward and futures contracts, hedging using futures contracts; option contracts and arbitrage relationship; binomial model, no-arbitrage pricing, risk-neutral pricing, and American options pricing; Brownian motion, Black-Scholes-Merton model, delta hedging, Greek letters, implied volatility, and volatility smile; classical and advanced portfolio management and execution models and strategies.", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Master the basics of derivatives, such as the mechanics, properties and functions of futures and options", "Use derivatives to conduct trading and hedging", "Price options using appropriate models including Black-Scholes-Merton model, binomial model and no-arbitrage principle", "Design basic portfolio management and execution strategies"]], "measurable_outcomes": [["Master the basics of derivatives, including terms, characteristics, pricing and execution.", "Use appropriate trading strategies based on the derivative properties, such as straddle strategy and butterfly strategy.", "Construct hedging strategies based on different risk concerns, including delta-neutral strategy, delta-gamma-neutral strategy.", "Price options using different methods, including BSM model, Binomial model.", "Construct the optimal portfolio balancing return and risk.", "Designing the optimal asset execution strategy targeting at minimum trading cost or risk exposure."]]}, {"name": "40.260 Supply Chain Management", "description": "Introduces concepts of supply chain design and operation. Topics include demand estimation, location and capacity planning, process analysis, inventory management, revenue management, supply chain procurement and coordination, and emerging topics in supply chains. A major aspect of the class is a student project on supply chain design.", "pre_requisite": [["40.012 Manufacturing and Service Operations"]], "learning_objectives": [["Develop an understanding of the challenges in the design and operation of supply chains.", "Learn modeling skills and problem-solving tools, applicable to the design, planning, and operation of supply chains.", "Conduct projects related to the design of a supply chain."]], "measurable_outcomes": [["Formulate mathematical models for demand modeling and forecasting, network design and transportation, production flow control and inventory management, revenue management, procurement and contracting.", "Solved above problems using xl based solvers.", "Present and critiqued industry cases related to above topics as well as emerging topics in supply chains.", "Participate in supply chain related simulation game that simulates real world decision making scenarios."]]}, {"name": "40.302 Advanced Topics in Optimisation#", "description": "This course is a follow-up to the ESD core course in Optimisation that students take in Term 4. The course will cover advanced topics in optimisation with a strong focus on modelling, formulations and optimisation techniques. Students will be introduced to the basics and design of algebraic modelling languages and spreadsheet models for describing optimisation problems. The primary application on which the course will be based is scheduling. Through the application, students will be exposed to advanced topics in optimisation such as proving optimality of schedules, integer programming formulations, heuristics, deterministic and stochastic dynamic optimization frameworks.", "pre_requisite": [["40.002 Optimisation"]], "learning_objectives": [["Use optimization techniques as a decision-making tool in scheduling applications.", "Model optimization problems using algebraic modeling languages and spreadsheets.", "Solve moderate-sized yet practical optimization problems that are not simple enough to be solved by hand using techniques such as integer programming, heuristics, deterministic and stochastic dynamic optimization."]], "measurable_outcomes": [["Formulate practical optimization problems in the scheduling domain that effectively tradeoff realism with tractability", "Use an algebraic modeling language to solve scheduling problems using the tool of integer programming", "Identify and develop appropriate methodologies to solve optimization problems in scheduling"]]}, {"name": "40.305 Advanced Topics in Stochastic Modelling#", "description": "This is a follow-up to the introduction course on Stochastic Modelling. Students learn advanced methods in stochastic modelling with a focus on business, engineering and financial math applications. Topics to be covered include renewal theory and martingales (discrete time). Time permitting other topics such as branching processes, spatial processes or stochastic networks could be introduced.", "pre_requisite": [["40.001 Probability"]], "learning_objectives": [["Apply the technique of Martingale in finance", "Apply renewal theory in operations management"]], "measurable_outcomes": [["Show the examples of Martingale, Renewal Process, and Brownian Motion.", "Construct or develop a stochastic model using these concepts.", "Identify and solve engineering problems involving these concepts.", "Analyse these concepts in a broader context of probability theory."]]}, {"name": "40.316 Game Theory", "description": "The course will provide a consistent framework for game-theoretic concepts, some of which have already been informally presented to the students in other courses. The course will cover the basic concepts in game theory, allowing the students to use strategic models in their capstone research.", "pre_requisite": [["10.007 Modelling The Systems World"]], "learning_objectives": [["Introduce elementary concepts of numerical methods for ODEs and PDEs.", "Develop the practice of error analysis.", "Analyse and solve, numerically, the PDEs that often arise in financial problems using finite difference and Monte-Carlo methods."]], "measurable_outcomes": [["Formalize a real life problem as a game,", "Find equilibria in simple strategic form games", "Compute some refinements of equilibria in extensive form games,", "Compute the price of anarchy in simple games,", "Design and run a simple experiment to test strategic behavior."]]}, {"name": "40.317 Financial Systems Design", "description": "This is a course in computational finance in which students learn the tools for delivering financial services and the algorithms used to price complex financial instruments (derivatives). It also abstracts the design of financial services, focusing on interface design, which reduces to language design. Only moderate coding proficiency is required (Python 3) but there are weekly coding exercises. The design exercise is to propose an interactive, distributed trading game and to specify the interfaces. Topics include:", "pre_requisite": [["40.242 Derivative Pricing and Risk Management", "At least one course beyond 10.009 The Digital World requiring the use of Python. Alternatively, by instructor permission upon demonstration of a software portfolio."]], "learning_objectives": [["Recognize and apply the tools of financial systems design in distributed environments;", "Create a systems level design by designing the system interfaces, viewing each interface as a “little language”; and", "Recognize and implement algorithms for pricing financial instruments (derivatives)"]], "measurable_outcomes": [["Create a code repository for version control;", "Create a console-based client;", "Create a multi-threaded server;", "Create a graphical user interface for the client;", "Store a history of transactions in a blockchain;", "Design the interfaces for a distributed system;", "Compute the price of a derivative via forward, backward, and central differences;", "Solve an ODE using numerical techniques;", "Solve a PDE using numerical techniques;", "Price an option using Monte Carlo simulation and apply variance reduction techniques;", "Price an American option."]]}, {"name": "40.318 Supply Chain Digitalisation and Design", "description": "Successful orchestration of planning and execution processes across virtual and global supply chain networks is a critical success factor for today’s businesses. This necessitates tight information integration across business functions and a strong alignment between the business and information technology functions. In the first half of the course we will study supply chain operations of a global manufacturing and distribution company, the NOVA Corporation. Using an experiential simulation of the company’s supply chain, we will identify common errors in the design of such systems. We will see in greater detail how logistics policies, organizational design, performance measurement systems, information flows, and even currency fluctuations can impact a company’s performance. Customer requirements ultimately determine a company’s manufacturing and distribution system requirements. The course material is unified around the theme of applying five basic principles of supply chain management to global manufacturing and logistics. The second half of the course develops a framework and process for discovering the value potential of digitalisation and ensuring value realization from investments in digital technologies.", "pre_requisite": [["40.260 Supply Chain Management"]], "learning_objectives": [["Enumerate five key principles in designing supply chains as a framework for analysis and action.", "Enumerate five key systems within a supply chain organization and describe their function.", "Observe and articulate the impact of uncertainty in supply chain operations.", "Contrast a capacity-based inventory strategy with a lead-time-based inventory strategy.", "Formulate an optimization-based approach to multi-item production planning.", "Apply customer requirements analysis to design a supply chain strategy.", "Identify key disconnects between Business and IT functions, from a strategy, process and technology systems requirements point of view.", "Demonstrate a clear understanding of the Approach, Methodology and Tools that can be used to align and discover value potential of digital technologies in supporting business and to ensure that the promised alignment and value of digital technologies is indeed being realized.", "Apply the methodologies and tools of Value Discovery and Value Realization in developing business cases."]], "measurable_outcomes": [["Calculate the impact on inventory levels of various degrees of uncertainty in upstream capacity and downstream demand.", "Formulate an optimization-based approach to multi-item production planning.", "Apply customer requirements analysis to design a supply chain strategy with reference to supply chain design principles and detailed at the level of supply chain functional systems.", "Construct a business value-driven digital technologies roadmap for a business case."]]}, {"name": "40.319 Statistical and Machine Learning", "description": "An agent is intelligent if it perceives its environment and takes actions that maximize its chances of successfully achieving its goals. In this course, we will study how to imbue machines with intelligence, focusing on foundational principles and mathematical theories of real-world modeling, problem solving and statistical learning. We will borrow strategies from biological intelligence such as neural networks and reinforcement learning. Students will learn powerful concepts from decision theory, information theory, generative models, deep learning, dimensionality reduction, expectation-maximization, time-series prediction, control theory and machine reasoning, and will exploit software tools for building intelligent systems.", "pre_requisite": [["10.007 Modelling The Systems World", "40.004 Statistics  (or 30.003/50.034 Introduction to Probability and Statistics)"]], "learning_objectives": [["Acquire a basic understanding in the fundamental concepts and principles of machine learning; decision theory, information theory, model selection, time series prediction, machine reasoning", "Understand and apply methods in supervised learning and generative models;", "generalized linear models, kernel methods, graphical models", "Understand and apply concepts in unsupervised learning and dimensionality reduction; autoencoders, matrix factorization, expectation-maximization, latent variables, mixture models", "Understand and apply techniques in reinforcement learning; Kalman filters, Q-learning", "Acquire a working knowledge of neural networks and backpropagation, and extend the techniques learnt to analyze standard deep learning models such as convolutional neural networks and recurrent neural networks"]], "measurable_outcomes": [["Design suitable mathematical models for real-world problems.", "Build intelligent systems by composing appropriate algorithms.", "Critique the strengths and weaknesses of different solutions."]]}, {"name": "40.320 Airport Systems Planning and Design", "description": "An airport is one of the most complex engineering systems in existence. It must simultaneously achieve ultra-high levels of safety and security while providing high throughput of passengers and cargo on a daily basis. It is an integrated system of systems bringing together airlines, air traffic controllers, baggage and cargo handlers, airport operators, customs, immigration, and security officers, as well as various ancillary support services such as connection to ground transportation and the provision of food, beverage, and emergency services. If you can appreciate the multiple dimensions of planning and design of an airport system, you are well-prepared to tackle many other system of systems challenges.", "pre_requisite": [["40.012 Manufacturing and Service Operations", "40.014 Engineering Systems Architecture"]], "learning_objectives": [["Know the basic systems, both airside and landside, that constitute an airport system from a functional perspective (what roles do they play).", "Know the basic terminology used to describe these systems.", "Know the performance metrics by which these systems are judged.", "Comprehend some of the interactions between these systems and the performance tradeoffs.", "Apply basic forecasting techniques to predict demand on these systems.", "Apply basic process analysis to compute the capacity of these systems.", "Comprehend the difficulty of making long term predictions of the impact of technology and economics on these demands and capacities.", "Recognize the rapid degradation in performance that accompanies highly utilized systems in the presence of uncertainty.", "Explain the need for flexibility in design for airport systems."]], "measurable_outcomes": [["Demonstrate mastery of the basic terminology used to describe airport systems.", "Demonstrate familiarity with basic tools of demand forecasting and capacity analysis.", "Demonstrate by means of an oral and written report, the ability to identify, describe, and analyze an issue in airport planning, design, or operation and to recommend policy changes or technology enhancements to address the issue."]]}, {"name": "40.321 Airport Systems Modelling and Simulation", "description": "Airports are complex systems that require the use of specialized modelling tools to be operated and managed efficiently. This course aims to provide students with appropriate knowledge and modelling skillset to critically apply simulation and optimization tools for airport systems planning, management and design. The modelling mindset is also applicable to other complex systems such as manufacturing facilities and hospitals. Topics include: airside capacity estimation, optimization of airport capacity utilization, airport demand management, simulation of airside aircraft movements, simulation of landside processes and air traffic flow management. A major aspect of this class is a final project where students are required to conduct a comprehensive simulation study on airport management using fast-time airport simulation tools (TAAM, Airtop, or CAST).", "pre_requisite": [["40.002 Optimisation", "40.015 Simulation Modelling and Analysis"]], "learning_objectives": [["Understand and identify the major challenges faced by airport planners and air traffic controllers in the planning and management of airport systems;", "Apply fast-time airport simulation tools to model airport systems (TAAM, Airtop, or CAST);", "Formulate mathematically classic problems of airport capacity/demand management and air traffic flow management;", "Analyse and assess the performance of airport systems using simulation and optimization tools;", "Design solutions aimed to address a given research problem within the context of airport planning and management."]], "measurable_outcomes": [["Demonstrate proficiency with the use of fast-time airport simulation tools (TAAM, Airtop, or CAST);", "Apply simulation tools to estimate airport capacity and predict airport flight delays;", "Apply optimization tools to make decisions with respect to airport capacity utilization, airport demand management, and air traffic flow management;", "Evaluate and improve the performance and utilization of airport systems by modelling airside aircraft movements;", "Evaluate and improve the performance of airspace systems by modelling en-route air traffic movements;", "Evaluate and improve the performance of landside facilities by modelling passenger movements."]]}, {"name": "40.323 Equity Valuation", "description": "This course introduces two key tools used by professional investors.", "pre_requisite": [["40.011 Data and Business Analytics", "40.240 Investment Science"]], "learning_objectives": [["Create a framework that links causal factors of firm performance with changes in the value of the company", "Combine the framework with analytic models of the value of equity share prices", "Hypothesize and prioritize the assumptions required for the analysis to be valid", "Identify data used to validate (or invalidate) the model and model assumptions"]], "measurable_outcomes": [["Estimate firm cash flows and cash flow growth, and integrate the analysis within the valuation framework", "Apply Damodaran’s methodology to estimating equity valuation risk and discount rate parameters", "Determine factors which drive changes in firm value using causal modelling techniques", "Devise methods to assess the merits of investment theses and assumptions required for the theses to hold"]]}, {"name": "40.324 Fundamentals of Investing", "description": "This course introduces topics relevant for students who want to understand the modern framework for evaluating investment opportunities. It combines key elements of managerial accounting and finance, as well as modern portfolio and asset pricing theory. After completing this course, students will be able to apply the core tool of analytic finance to assess the value of company projects, including those undertaken by start‐ups. They will also be able to analyze financial market conditions to recommend investment strategies.", "pre_requisite": [["10.001 Advanced Mathematics I", "10.004 Advanced Math II", "30.3003 / 50.034 Introduction to Probability and Statistics"]], "learning_objectives": [["Define key accounting metrics and apply these metrics to evaluate the performance of a company.", "Identity and interpret techniques to value cash flows from investing in firm projects.", "Develop equity valuation frameworks that link stock prices to firm cash flows and risk.", "Derive optimal allocation rules for investing in portfolios with one or two risky assets.", "Identify optimal portfolio allocation rules for many risky assets, such as stocks, commodities, real estate and bonds. Combine the optimal allocation rules with index models to identify the degree of diversification in an optimal portfolio.", "Hypothesize and derive a linear relation between risk and expected returns.", "Define factors that determine bond prices. Synthesize bond pricing relations with no‐arbitrage equilibrium models of spot and forward rates."]], "measurable_outcomes": [["Create a financial planning spreadsheet for a start‐up company.", "Estimate cash flows generated by a company project, and develop decision rules for whether to invest in the project.", "Determine the value of the stock using valuation by comparables.", "Use optimal allocation rules to recommend allocations to stocks vs cash.", "Construct optimal portfolios for investors that account for the risk and expected returns of the assets in the portfolio.", "Devise and implement methods to estimate and test the linear relation between risk and expected return.", "Design no‐arbitrage trading strategies to identify possible violations of no‐arbitrage equilibrium."]]}, {"name": "01.102 Energy Systems and Management", "description": "Broadly, this course aims to acquaint students with both the operation and economics of modern electric power systems. Topics include optimal power flow, unit commitment, economic dispatch, electricity markets, as well as emerging techniques for renewable energy integration and demand response. By the end of the course, students will have developed a firm grasp of optimal power system operations, the emerging challenges facing deep renewable energy integration, tools to effectively tackle said challenges, as well as the energy system and markets in Singapore.", "pre_requisite": [["10.004 Advanced Math II"]], "learning_objectives": [["Solve basic power flow equations by incorporating engineering constraints in power networks", "Apply mathematical models to analyse the operation and economics of wholesale electricity markets", "Identify the opportunity and challenges brought by renewable energy integration"]], "measurable_outcomes": [["Formulate the optimal power flow problem for electric power networks", "Analyse the operation and economics of (deregulated) wholesale electricity markets", "Analyse the challenges brought by growing renewable generation to power systems", "Identify the challenges of providing reliable power supply in developing countries, as well as the current practice to mitigate electricity shortage in some developing countries."]]}, {"name": "01.104 Networked Life", "description": "Driven by a number of real-world questions about our networked lives, this course explores the technology behind the multi-trillion dollar Internet and wireless industries.", "pre_requisite": [["10.007 Modelling the Systems World"]], "learning_objectives": [["Describe some of the key networked life applications, the basic real problems they solve, and the value they bring to society. Recognize the key technology innovation in modern networking technologies like CDMA, WiFI, page rank, recommendation systems, social media, Internet flow control, cloud computing, content distribution networks, network pricing, IPTV, etc.", "Classify these applications in terms of the common mathematical models and tools used, and explain the basic theory used in each case.", "Apply the appropriate mathematical tools (game theory, social network and graph theory, optimization, concepts like feedback, equilibrium, coordination, fairness, reputation) in the different context of each application and observe the limitations of the various models.", "Analyze the performance of the solutions in the different application contexts and environment constraints.", "Determine the effects on the solutions when assumptions or parameters of the models are changed.", "Evaluate the way current networked life applications perform, explain why particular solutions have dominated the technology space."]], "measurable_outcomes": [["Students will define the reasons for developing the given applications and their value in targeted class discussions (LO1).", "In each of the application areas, the student will apply the appropriate mathematical tools (game theory, social network and graph theory, optimization, feedback, equilibrium, coordination, fairness, reputation) to analyze the system performance through weekly HWs (LO3, LO4).", "Students will solve problems that illustrate the importance of various system parameters in the context of each application and and develop solutions that are practical and mathematically sound (LO5).", "Students will answer questions regarding the evaluation of the various solution concepts, their appropriateness, and also their weaknesses (LO6)."]]}, {"name": "01.107 Urban Transportation", "description": "This course provides students with an understanding of current challenges and opportunities in land transportation. It introduces road vehicle propulsion technologies and transportation systems modelling, including the tools and methods to assess technologies and system performance. Topics include conventional and alternative vehicle powertrains, intelligent transportation systems (ITS), transportation network modelling, traffic simulation, and travel demand modelling. Students will complete a project on a subject of their choosing.", "pre_requisite": [], "learning_objectives": [["Explain the system-level transportation challenges and how these might be overcome in the future.", "Assess demand and supply and intra- and inter-system interactions, and how to design systems for passenger and freight transportation", "Evaluate the socio-technical tradeoffs and limitations of various transportation solutions."]], "measurable_outcomes": [["Assess and critique the effectiveness of urban transportation systems", "Model, explore and report (orally and written) the performance of transportation systems under different policies, services, infrastructures, and technologies", "Describe and compare the merits of different vehicle propulsion system designs"]]}]